package com.example.domain.model

enum class TimeFrame(val code: String, val labelFa: String, val description: String) {
    M1("1m", "۱ دقیقه", "تایم‌فریم اسکالپ بسیار سریع"),
    M5("5m", "۵ دقیقه", "تایم‌فریم معاملات روزانه سریع"),
    M15("15m", "۱۵ دقیقه", "تایم‌فریم اصلی معاملات روزانه"),
    H1("1h", "۱ ساعت", "تایم‌فریم تایید روند کوتاه مدتی"),
    H4("4h", "۴ ساعت", "تایm‌فریم معاملات سویینگ و روند متوسط"),
    D1("1D", "روزانه", "تایم‌فریم تحلیل اصلی روند کلان"),
    W1("1W", "هفتگی", "تایم‌فریم سرمایه‌گذاری بلندمدت")
}
